[
    {
        "sign": "Aries",
        "horoscope": "You may get all nostalgic and wistful today, predicts Ganesha. You will go out of your way to improve your relationships. To you, your commitment is an investment for the future. The result is loving life-long bonds."
    },
    {
        "sign": "Taurus",
        "horoscope": "Financial gains are on the cards today, predicts Ganesha. Happiness will fly in as you receive some good news from an overseas friend. If you have feelings that you haven't expressed to someone you dearly love, today is a good day to go ahead and let them know. The evening promises rejoicing and relaxation, says Ganesha."
    },
    {
        "sign": "Gemini",
        "horoscope": "Today, you will have the required intentions and courage to propose your sweetheart. You will be dressed to kill, or rather to marry. You will make a favourable impression with the way you'll look tonight. You will be an open book to your future partner, which is likely to work in your favour."
    },
    {
        "sign": "Cancer",
        "horoscope": "You will be in high spirits today, foretells Ganesha. It is a favourable day to engage in household activities, like gardening, cooking or even washing laundry. In the evening, work will be eclipsed by the pleasures of love."
    },
    {
        "sign": "Leo",
        "horoscope": "Time is one thing that you have in short change today, says Ganesha. There is every possibility that you shall remain extremely busy. The tasks may be small — like writing a letter to revive old contacts — but it is important that you do them. Chances are that you may also end up giving a few interviews over the phone. Just remember that your ability to make things work and do your best make you the prime candidate for organising and conducting urgent meetings. In short, buckle up as Ganesha predicts a busy day."
    },
    {
        "sign": "Virgo",
        "horoscope": "Family matters will matter today. They hold more weight in your thoughts than everything else, says Ganesha. Business will be good today. Spend the evening relaxing and chilling out. On the cards is a visit to a place of worship."
    },
    {
        "sign": "Libra",
        "horoscope": "Your concern for your family surmounts all else, that much Ganesha knows. Today, you will fulfil your filial duties in all that you undertake. As Ganesha rightly points out: All good things begin at home, including your fortune and good luck."
    },
    {
        "sign": "Scorpio",
        "horoscope": "A healthy and hectic day is in store for you today. You are likely to finish your pending tasks with new zeal. But the chaotic day will blossom into a fabulous evening when you hang out with your sweetheart, says Ganesha."
    },
    {
        "sign": "Sagittarius",
        "horoscope": "Chances of you hitting a roadblock today are high. But remember the saying, ‘When the going gets tough, the tough get going.' So don't succumb to pressure, advises Ganesha, but rise up to the occasion and show who's the boss."
    },
    {
        "sign": "Capricorn",
        "horoscope": "You will have heard of many emotional fools who let sentiments rule their lives. Try not be one of them, and if it's too difficult a task, at least pretend not to be one of them, for Ganesha says going by your feelings can leave you at a low ebb. In other words, your feelings can come in the way of your success. A solution to this problem is to remain dispassionate and let the opportunist think you are a hard nut to crack."
    },
    {
        "sign": "Aquarius",
        "horoscope": "You will prove yourself today by staying ahead of your rivals in all ways. You will conquer your frustrations, and will soon be raring to go. Your pleasing demeanour endears you to others and you win admiration from all quarters, says Ganesha."
    },
    {
        "sign": "Pisces",
        "horoscope": "An action-packed day awaits you, busy as you will be corresponding with old contacts, telephonic interviews, organising meetings and scheduling tasks, says Ganesha. Do not forget to breathe!"
    }
]